# DisplayNodeNumbers Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..DisplayNodeNumbers Property
DividedPath Class See Also
---
Controls whether the node numbers are shown when the divided path is selected
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool DisplayNodeNumbers { get; set; }
```

Visual Basic
---
```text
Public Property DisplayNodeNumbers As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool DisplayNodeNumbers {
	bool get ();
	void set (bool value);
}
```

# Remarks
If true the divided path will show the number of each node when the divided path is selected. If false the node numbers are hidden.
# See Also
DividedPath Class
Autodesk.Revit.DB Namespace